ralmn/TeleInfoWB55/firmware/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.elec.meas.h"

/* USER CODE BEGIN Includes */
#include "zcl/general/zcl.basic.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define CHANNEL                                     11

#define SW1_ENDPOINT                                1

/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_ConfigNames(void);
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  bool init_after_join;

  struct ZbZclClusterT *electricalMeasurement_server_1;
};
static struct zigbee_app_info zigbee_app_info;

/* USER CODE BEGIN PV */

static struct ZbZclElecMeasSvrCallbacksT ElecMeasServerCallbacks_1 = {};

static const struct ZbZclAttrT optional_attr_list[] = { {
		ZCL_ELEC_MEAS_ATTR_RMS_CURR, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } }, {
		ZCL_ELEC_MEAS_ATTR_AC_CURR_MULT, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } }, {
		ZCL_ELEC_MEAS_ATTR_AC_CURR_DIVISOR, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } }, {
		ZCL_ELEC_MEAS_ATTR_APPARENT_PWR, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } }, {
		ZCL_ELEC_MEAS_ATTR_RMS_CURR_MAX, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } }, {
		ZCL_ELEC_MEAS_ATTR_TOTAL_ACTIVE_PWR, ZCL_DATATYPE_UNSIGNED_16BIT,
		ZCL_ATTR_FLAG_REPORTABLE | ZCL_ATTR_FLAG_PERSISTABLE
				| ZCL_ATTR_FLAG_WRITABLE, 0, NULL, { 0, 0 }, { 0, 0 } } };

struct tele_info_data {
	uint16_t current;
	uint16_t currentMax;
	uint16_t apparentPower;
	int32_t totalActivePower;
};

static bool ready = false;

static struct tele_info_data tele_info_data = { .current = 4, .currentMax = 1,
		.apparentPower = 2, .totalActivePower = 3 };

/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Register task */
  /* Create the different tasks */

