ralmn/TeleInfoWB55/firmware/STM32_WPAN/App/app_zigbee.c
}

void APP_ZIGBEE_ExportMesure_cb(const struct ZbZclWriteRspT *rsp, void *cbarg) {
	UNUSED(rsp);
	UNUSED(cbarg);
}

void APP_ZIGBEE_ExportMesure(void) {

	if (zigbee_app_info.zb == NULL) {
		return;
	}

	if(!ready) return;

	/* Check if the router joined the network */
	uint64_t epid = 0U;
	if (ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid,
			sizeof(epid)) != ZB_STATUS_SUCCESS) {
		return;
	}
	if (epid == 0U) {
		return;
	}

	enum ZbStatusCodeT status;

	ZbZclWriteReqT req;
	/* populate req */
	memset(&req, 0, sizeof(req));
	req.dst.mode = ZB_APSDE_ADDRMODE_NOTPRESENT; /* send to binding */
	req.dst.endpoint = SW1_ENDPOINT;

	uint8_t index = 0;

	uint16_t currentLE;
	putle16((uint8_t*) &currentLE, tele_info_data.current);

	req.attr[index].attrId = ZCL_ELEC_MEAS_ATTR_RMS_CURR;
	req.attr[index].type = ZCL_DATATYPE_UNSIGNED_16BIT;
	req.attr[index].value = (uint8_t*) &currentLE;
	req.attr[index].length = 2;

	index++;

	//uint16_t currentMax = randomGen(600, 700);
	uint16_t currentMaxLE;
	putle16((uint8_t*) &currentMaxLE, tele_info_data.currentMax);

	req.attr[index].attrId = ZCL_ELEC_MEAS_ATTR_RMS_CURR_MAX;
	req.attr[index].type = ZCL_DATATYPE_UNSIGNED_16BIT;
	req.attr[index].value = (uint8_t*) &currentMaxLE;
	req.attr[index].length = 2;

	index++;

	//uint16_t appPWR = randomGen(0, 6);
	uint16_t appPWRLE;
	putle16((uint8_t*) &appPWRLE, tele_info_data.apparentPower);

	req.attr[index].attrId = ZCL_ELEC_MEAS_ATTR_APPARENT_PWR;
	req.attr[index].type = ZCL_DATATYPE_UNSIGNED_16BIT;
	req.attr[index].value = (uint8_t*) &appPWRLE;
	req.attr[index].length = 2;

	index++;

	int32_t totalActivePWR = tele_info_data.totalActivePower;

	req.attr[index].attrId = ZCL_ELEC_MEAS_ATTR_TOTAL_ACTIVE_PWR;
	req.attr[index].type = ZCL_DATATYPE_SIGNED_32BIT;
	req.attr[index].value = (uint8_t*) &totalActivePWR;
	req.attr[index].length = 4;

	req.count = index + 1;

	status = ZbZclWriteReq(zigbee_app_info.electricalMeasurement_server_1, &req,
			APP_ZIGBEE_ExportMesure_cb, NULL);

	UNUSED(status);

	/*if (status == ZCL_STATUS_SUCCESS) {
		HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_RESET);
	} else {
		HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_SET);
	}*/

}

void APP_ZIGBEE_TeleInfo_Current(uint16_t current) {

	if (current != tele_info_data.current || true) {
		tele_info_data.current = current;
		//APP_ZIGBEE_ExportMesure();
		//UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_SEND_DATA, CFG_SCH_PRIO_0);
	}

}
void APP_ZIGBEE_TeleInfo_CurrentMax(uint16_t currentMax) {

	if (currentMax != tele_info_data.currentMax) {
		tele_info_data.currentMax = currentMax;
		//APP_ZIGBEE_ExportMesure();
		//UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_SEND_DATA, CFG_SCH_PRIO_0);
	}

}
void APP_ZIGBEE_TeleInfo_TotalActivePower(int32_t totalActivePower) {
	if (totalActivePower != tele_info_data.totalActivePower) {
		tele_info_data.totalActivePower = totalActivePower;
		//APP_ZIGBEE_ExportMesure();
		//UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_SEND_DATA, CFG_SCH_PRIO_0);
	}
}
void APP_ZIGBEE_TeleInfo_ApparentPower(uint16_t apparentPower) {
	if (apparentPower != tele_info_data.apparentPower) {
		tele_info_data.apparentPower = apparentPower;
		//APP_ZIGBEE_ExportMesure();
		//UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_SEND_DATA, CFG_SCH_PRIO_0);
	}
}

/* USER CODE END FD_LOCAL_FUNCTIONS */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

